from dots import Dots
from input import read_choice_from_stdin

PRESETS = [
    dict(
        name='первая',
        dot_list=[
            (3, 3),
            (4, 4),
            (5, 5),
            (6, 6),
            (7, 7),
            (8, 8),
            (9, 9),
        ]
    ),
    dict(
        name='вторая',
        dot_list=[
            (0.0, 0),
            (0.4, 0.952),
            (0.8, 1.8494),
            (1.2, 2.4679),
            (1.6, 2.5366),
            (2.0, 2.1379),
            (2.4, 1.6112),
            (2.8, 1.1656),
            (3.2, 0.8417),
            (3.6, 0.6167),
            (4.0, 0.461),
        ],
    ),
    dict(
        name='третья',
        dot_list=[
            (1.10, 0.2234),
            (1.25, 1.2438),
            (1.40, 2.2644),
            (1.55, 3.2984),
            (1.70, 4.3222),
            (1.85, 5.3516),
            (2.00, 6.3867),
        ],
    ),
    dict(
        name='четвертая',
        dot_list = [
            (1.0, 1.0),
            (2.0, 4.0),
            (3.0, 9.0),
            (4.0, 16.0),
            (5.0, 25.0),
            (6.0, 36.0),
            (7.0, 5.0),
        ],
    ),
    dict(
        name='sin(x)',
        dot_list=[
            (0.0, 0.0),
            (0.5236, 0.5),
            (1.0472, 0.866),
            (1.5708, 1.0),
            (2.0944, 0.866),
            (2.618, 0.5),
            (3.1416, 0.0),
            (3.665, -0.5),
            (4.189, -0.866),
            (4.712, -1.0),
        ],
    ),
    dict(
        name='ln(x)',
        dot_list=[
            (0.5, -0.693),
            (1.0, 0.0),
            (1.5, 0.405),
            (2.0, 0.693),
            (2.5, 0.916),
            (3.0, 1.099),
            (3.5, 1.253),
            (4.0, 1.386),
            (4.5, 1.504),
            (5.0, 1.609),
        ],
    ),
]


def get_preset_function() -> Dots:
    preset_index = read_choice_from_stdin(
        'Выберите функцию',
        [
            preset['name']
            for preset in PRESETS
        ],
    )

    dot_list = PRESETS[preset_index]['dot_list']
    xs = [x for x, _y in dot_list]
    ys = [y for _x, y in dot_list]

    return Dots(xs, ys)
